using NProtocol.Communication.Exceptions;
using System.Collections.Generic;

namespace NProtocol.Protocols.Fins
{
    public class FinsErrorCodeException : ReceivedException
    {

        public FinsErrorCodeException(ushort code, byte[] sendData, byte[] receiveData, string driverId)
            : base(GetErrorMessage(code), sendData, receiveData, driverId)
        {

        }
        public static string GetErrorMessage(ushort code)
        {
            if (FrameErrorCodeValues.TryGetValue(code, out var msg))
            {
                return $"ErrorCode:{code},ErrorMessage:{msg}";
            }
            return "Unknow error";
        }
        private static IReadOnlyDictionary<ushort, string> FrameErrorCodeValues => new Dictionary<ushort, string>()
        {
            //正常完成
            { 0x0000, "正常完成" },
            { 0x0001, "服务已取消" },
            //本地节点错误
            { 0x0101, "本地节点不在网络中" },
            { 0x0102, "令牌超时" },
            { 0x0103, "重试失败" },
            { 0x0104, "发送帧过多" },
            { 0x0105, "节点地址范围错误" },
            { 0x0106, "节点地址重复" },
            //目标节点错误
            { 0x0201, "目标节点不在网络中" },
            { 0x0202, "单元缺失" },
            { 0x0203, "第三个节点缺失" },
            { 0x0204, "目标节点忙碌" },
            { 0x0205, "响应超时" },
            //控制器错误
            { 0x0301, "通信控制器错误" },
            { 0x0302, "CPU单元错误" },
            { 0x0303, "控制器错误" },
            { 0x0304, "单元编号错误" },
            //服务不受支持
            { 0x0401, "未定义命令" },
            { 0x0402, "不受模型/版本支持" },
            //路由表错误
            { 0x0501, "目标地址设置错误" },
            { 0x0502, "没有路由表" },
            { 0x0503, "路由表错误" },
            { 0x0504, "继电器过多" },
            //命令格式错误
            { 0x1001, "命令过长" },
            { 0x1002, "命令过短" },
            { 0x1003, "元素/数据不匹配" },
            { 0x1004, "命令格式错误" },
            { 0x1005, "标题错误" },
            //参数错误
            { 0x1101, "区域分类缺失" },
            { 0x1102, "访问大小错误" },
            { 0x1103, "地址范围错误" },
            { 0x1104, "超出地址范围" },
            { 0x1106, "程序缺失" },
            { 0x1109, "关系错误" },
            { 0x110A, "数据访问重复" },
            { 0x110B, "响应过长" },
            { 0x110C, "参数错误" },
            //无法读取
            { 0x2002, "受保护" },
            { 0x2003, "表缺失" },
            { 0x2004, "数据缺失" },
            { 0x2005, "程序缺失" },
            { 0x2006, "文件缺失" },
            { 0x2007, "数据不匹配" },
            //无法写入
            { 0x2101, "只读" },
            { 0x2102, "受保护，无法写入数据链路表" },
            { 0x2103, "无法注册" },
            { 0x2105, "程序缺失" },
            { 0x2106, "文件缺失" },
            { 0x2107, "文件名已经存在" },
            { 0x2108, "无法更改" },
            //在当前模式下不可执行
            { 0x2201, "在执行期间无法进行" },
            { 0x2202, "运行时无法实现" },
            { 0x2203, "PLC模式错误" },
            { 0x2204, "PLC模式错误" },
            { 0x2205, "PLC模式错误" },
            { 0x2206, "PLC模式错误" },
            { 0x2207, "指定的节点不是轮询节点" },
            { 0x2208, "无法执行步骤" },
            //没有这样的设备
            { 0x2301, "文件设备缺失" },
            { 0x2302, "内存缺失" },
            { 0x2303, "时钟缺失" },
            //无法启动/停止
            { 0x2401, "表缺失" },
            //单元错误
            { 0x2502, "内存错误" },
            { 0x2503, "I/O设置错误" },
            { 0x2504, "I/O点过多" },
            { 0x2505, "CPU总线错误" },
            { 0x2506, "I/O重复" },
            { 0x2507, "I/O总线错误" },
            { 0x2509, "SYMACBUS/2错误" },
            { 0x250A, "CPU 总线单元错误" },
            { 0x250D, "SYSMAC BUS 编号重复" },
            { 0x250F, "内存错误" },
            { 0x2510, "SYSMAC BUS 终结器" },
            //命令错误
            { 0x2601, "无保护" },
            { 0x2602, "密码不正确" },
            { 0x2604, "受保护" },
            { 0x2605, "服务已经在执行" },
            { 0x2606, "服务已停止" },
            { 0x2607, "没有执行权限" },
            { 0x2608, "设置未完成" },
            { 0x2609, "未设置所需项" },
            { 0x260A, "已定义编号" },
            { 0x260B, "错误未清除" },
            //访问权限错误
            { 0x3001, "没有访问权限" },
            //终止
            { 0x4001, "服务已中止" },
        };
    }
}
